[chore] tune flow
